case/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# runApplication blockMesh

# runApplication splitMeshRegions -cellZones

# paraFoam -region gas -touch
# paraFoam -region solid -touch

#runApplication decomposePar -allRegions

runParallel myfoamMultiRun

runApplication reconstructPar -allRegions -newTimes

#------------------------------------------------------------------------------
