case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       127120;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       127180;
    }
    gas_sys
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          800;
        startFace       127240;
    }
    solid_left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       128040;
    }
    solid_right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       128060;
    }
    wall_bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       128080;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          128000;
        startFace       128880;
    }
)

// ************************************************************************* //
