case/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    solid_left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       31180;
    }
    solid_right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       31200;
    }
    wall_bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       31220;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          32000;
        startFace       32020;
    }
    solid_to_gas
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mapped
)
;
        nFaces          800;
        startFace       64020;
        neighbourRegion gas;
        neighbourPatch  gas_to_solid;
        transformType   none;
    }
)

// ************************************************************************* //
