case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin 0;
xmax 1;

ymin 0;
ymid 0.025;
ymax 0.1;

zmin 0;
zmax 0.01;

xcell 800;
ycell 20;
zcell 1;

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)

    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)

    ($xmin $ymid $zmin)
    ($xmax $ymid $zmin)
    ($xmax $ymid $zmax)
    ($xmin $ymid $zmax) 
);

blocks
(
    hex (0 1 9 8 4 5 10 11) solid ($xcell $ycell $zcell) simpleGrading (1 1 1)
    hex (8 9 2 3 11 10 6 7)   gas ($xcell 60 $zcell) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((8 11 7 3));
    }

    outlet
    {
        type patch;
        faces ((9 2 6 10));
    }
    // wall_gas
    // {
    //     type wall;
    //     faces ((2 3 7 6));
    // }

    gas_sys
    {
        type symmetry;
        faces ((2 3 7 6));
    }

    solid_left
    {
        type wall;
        faces ((0 4 11 8));
    }

    solid_right
    {
        type wall;
        faces ((1 9 10 5));
    }

    wall_bottom
    {
        type wall;
        faces ((0 1 4 5));
    }

    frontAndBack
    {
        type empty;
        faces ((6 7 11 10)  (3 2 9 8) (10 11 4 5) (8 9 1 0));
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
