case/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  4;

method          scotch;

simpleCoeffs
{
  n               ( 2 1 1 );
  delta           0.001;
}

// hierarchicalCoeffs
// {
//     n           (1 4 1);
//     order       xyz;
// }

manualCoeffs
{
    dataFile        "cellDecomposition";
}

// ************************************************************************* //
